
&НаСервере
Процедура ТипыПараметровПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.ОсновнойТипПараметра) Тогда
		
		
	Иначе     
		Если Объект.ТипыПараметров.Количество() <> 0 Тогда
			ПервыйЗаполнен = Ложь;
			МассивПустыхСтрок = Новый Массив;
			Для Каждого ТекСтрокаСсылкаТип  Из Объект.ТипыПараметров Цикл
				Если ЗначениеЗаполнено(ТекСтрокаСсылкаТип.ТипПараметра) Тогда
					
					Если НЕ ПервыйЗаполнен И  Не ЗначениеЗаполнено(Объект.ОсновнойТипПараметра) Тогда
						Объект.ОсновнойТипПараметра = ТекСтрокаСсылкаТип.ТипПараметра; 
					КонецЕсли;	
					
					ПервыйЗаполнен = Истина;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПроверкаИИзменениеТипаНаСервере(СтароеЗначениеПараметра, НовоеЗначениеПараметра)
	Если ЗначениеЗаполнено(НовоеЗначениеПараметра) Тогда
		СтрокаСПараметромСтар = Неопределено;
		СтрокаСПараметромНов = Неопределено;
		Для Каждого ТекСтрокаПар Из Объект.ТипыПараметров Цикл
			Если ТекСтрокаПар.ТипПараметра = СтароеЗначениеПараметра Тогда
				СтрокаСПараметромСтар = ТекСтрокаПар;	
				
			КонецЕсли;	
			Если ТекСтрокаПар.ТипПараметра = НовоеЗначениеПараметра Тогда
				СтрокаСПараметромНов = ТекСтрокаПар;	
			КонецЕсли;	
		КонецЦикла;
		
		Если  СтрокаСПараметромНов = Неопределено И СтрокаСПараметромСтар <> Неопределено Тогда
			СтрокаСПараметромСтар.ТипПараметра = НовоеЗначениеПараметра;
		ИначеЕсли СтрокаСПараметромНов = Неопределено и СтрокаСПараметромСтар = Неопределено Тогда
			СтрокаСПараметромНов = Объект.ТипыПараметров.Добавить();
			СтрокаСПараметромНов.ТипПараметра = НовоеЗначениеПараметра; 
		КонецЕсли;	
	КонецЕсли;		
Конецпроцедуры	

&НаСервере
Процедура ЗаполнениеЗначенийНаСервере()
	Если ЗначениеЗаполнено(Объект.Родитель) и Не ЗначениеЗаполнено(Объект.ВидПараметра) Тогда
		Объект.ВидПараметра = Объект.Родитель.ВидПараметра;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ДоступКЭлементамФормы()
	Если ЗначениеЗаполнено(Объект.Родитель)Тогда
		Элементы.ПорядокВВызове.ТолькоПросмотр = Ложь;
		Элементы.Обязательный.ТолькоПросмотр = Ложь;
		Элементы.ЗначениеПоУмолчанию.ТолькоПросмотр = Ложь
		
	Иначе	
		Элементы.ПорядокВВызове.ТолькоПросмотр = Истина;
		Элементы.Обязательный.ТолькоПросмотр = Истина;
		Элементы.ЗначениеПоУмолчанию.ТолькоПросмотр = Истина;
		
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
Процедура ТипыПараметровПриИзменении(Элемент)
	ТипыПараметровПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойТипПараметраОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПроверкаИИзменениеТипаНаСервере(Объект.ОсновнойТипПараметра, ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТипыПараметровПриИзмененииНаСервере();
	ПроверкаИИзменениеТипаНаСервере(Неопределено, Объект.ОсновнойТипПараметра);
	ЗаполнениеЗначенийНаСервере(); 
	ДоступКЭлементамФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ПараметрыОтредактированы");
КонецПроцедуры
