
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Поля.Добавить("Знание");
	СтандартнаяОбработка=Ложь;
КонецПроцедуры


Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Представление=Данные.Знание;
	СтандартнаяОбработка=Ложь;
КонецПроцедуры


Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	Поиск = ВРЕГ(СокрЛП(Параметры.СтрокаПоиска));
	Если Поиск="" Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	| Спр.Ссылка КАК Ссылка,
	| Спр.Знание КАК Знание
	|ИЗ
	| Справочник.SZ_БазаЗнаний КАК Спр
	|ГДЕ
	| Спр.ЭтоГруппа = ИСТИНА
	| И Спр.Знание ПОДОБНО ""%"+Поиск+"%""";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка,СокрЛП(Выборка.Знание));
	КонецЦикла; 
	ДанныеВыбора.СортироватьПоПредставлению();
КонецПроцедуры

