
&НаСервере
Процедура ЗагрузитьДанныеИзФайлаКонфигурацииНаСервере(СтруктураПараметров)
	АМ_РаботаСТекстомПроцедурИФункцийСервер.РазобратьМассивФайловНаСервере(СтруктураПараметров);
КонецПроцедуры



&НаСервере
Функция ПолучитьИскомыеСсылки_Скрвер(ТекСсылкаМодуль)
	
	СтруктураСсылок = Новый Структура;
	СтруктураСсылок.Вставить("СсылкаКонфигурация", ТекСсылкаМодуль.Владелец);
	СтруктураСсылок.Вставить("НаименованиеМодуля", ТекСсылкаМодуль.Наименование);
	СтруктураСсылок.Вставить("КаталогЗагрузки", РегистрыСведений.АМ_КаталогиФайловМодулейКонфигураций.ПолучитьКаталогПоКонфигурации(ТекСсылкаМодуль.Владелец));
	ВидЗагрузки = ?(ТипЗнч(ТекСсылкаМодуль) = Тип("СправочникСсылка.АМ_МодулиОбъектовМетаданных"),2,1);
	СтруктураСсылок.Вставить("ВидЗагрузки", ВидЗагрузки);
	
	Возврат СтруктураСсылок;
	
КонецФункции	

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайлаКонфигурации(Команда)
	
	СтруктураСсылок = ПолучитьИскомыеСсылки_Скрвер(Команда.ИспользуемаяТаблица.ТекущиеДанные.Владелец); 
		
	КаталогКонфы = СтруктураСсылок.КаталогЗагрузки;
	
	АМ_РаботаСТекстомПроцедурИФункцийКлиентСервер.ПрочитатьФайлыИПоместитьДляАнализа(ЭтаФорма.АдресХранилищаМассивовФайлов, ЭтаФорма.УникальныйИдентификатор, КаталогКонфы, СтруктураСсылок.ВидЗагрузки);
	
	СтруктураПараметров = АМ_РаботаСТекстомПроцедурИФункцийКлиентСервер.ПолучитьСтруктуруПараметровЗапускаЗакгрузки();
	СтруктураПараметров.Конфигурация =  СтруктураСсылок.СсылкаКонфигурация;
	СтруктураПараметров.НаименованиеМодуля = СтруктураСсылок.НаименованиеМодуля;
	СтруктураПараметров.НаименованиеМетода= Команда.ИспользуемаяТаблица.ТекущиеДанные.Наименование;
	СтруктураПараметров.АдресСМассивомФайлов  = ЭтаФорма.АдресХранилищаМассивовФайлов;
	СтруктураПараметров.ВидЗагрузки = СтруктураСсылок.ВидЗагрузки;
	
	Если Команда.ИспользуемаяТаблица.ТекущиеДанные.КомментарийВручную Тогда
		Сообщить("На методе стоит признак ""Комментарий вручную"", параметры не будут загружаться.");
	КонецЕсли;	
	
	ЗагрузитьДанныеИзФайлаКонфигурацииНаСервере(СтруктураПараметров);
    
	
КонецПроцедуры
