&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура Руф_ОбработкаПроведения1(Отказ, РежимПроведения)
	
	НаборЗаписей = Движения.узФактПоЗадачам;
	НаборЗаписей.Записывать = Истина; 
	#Вставка
	НаборЗаписейРуф_КонтрольРеализаций = Движения.Руф_КонтрольРеализаций;
	НаборЗаписейРуф_КонтрольРеализаций.Записывать = Истина;
	#КонецВставки
	
	Для каждого СтрокаДанные из Данные цикл
		
		Запись = НаборЗаписей.Добавить();		
		Запись.Период = Дата;
		Запись.Задача = Задача;
		Запись.Исполнитель = Исполнитель;
		Запись.Спринт = СтрокаДанные.Спринт;
		Запись.ДатаНачала = СтрокаДанные.ДатаНачала;
		Запись.ДатаОкончания = СтрокаДанные.ДатаОкончания;
		
		// +++ 79Vlad  25.10.2018
		Запись.Примечание = СокрЛП(СтрокаДанные.Примечание);
		// --- 79Vlad  25.10.2018
		
		#Удаление
		Запись.Факт = СтрокаДанные.Факт;
		#КонецУдаления
		#Вставка
		// Здесь можно описать новое поведение.
		Запись.Факт = СтрокаДанные.Факт;       
		
		//(+++++Руфат 07.03.2025 13:21:50
		
		Запись.Руф_ТипВремени  = СтрокаДанные.Руф_ТипВремени; 
		Если СтрокаДанные.Руф_ТипВремени.ОплачиваемоеСпециалисту Тогда
			Запись.Руф_ВРасчет  = ?(СтрокаДанные.Руф_ТипВремени.Количественное, 1, СтрокаДанные.Руф_ВРасчет);
		КонецЕсли;
		
		//)+++++Руфат 07.03.2025 13:21:50		 
		
		//Руф 060525 1800 
		Если СтрокаДанные.Руф_ТипВремени.ПозицияСМ = Перечисления.Руф_ПозицииСМ.БЧВСчетКоробки или
			 СтрокаДанные.Руф_ТипВремени.ПозицияСМ = Перечисления.Руф_ПозицииСМ.УстановкаПП1С или
			 СтрокаДанные.Руф_ТипВремени.ПозицияСМ = Перечисления.Руф_ПозицииСМ.ЭЧ Тогда
		Движение = НаборЗаписейРуф_КонтрольРеализаций.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Задача = Задача;
		Движение.Исполнитель = Исполнитель;
		Движение.ТипВремени = СтрокаДанные.Руф_ТипВремени;
		Движение.Контрагент = Задача.Контрагент;
		Движение.ВЗР = Задача.Руф_ВЗР;
		Движение.Часы = ?(СтрокаДанные.Руф_ТипВремени.Количественное, СтрокаДанные.Руф_ВРасчет/60*СтрокаДанные.Руф_ТипВремени.КоличествоМинутВЕдинице, СтрокаДанные.Руф_ВРасчет);
		КонецЕсли;
		//Руф
		
		#КонецВставки
	Конеццикла;
	
КонецПроцедуры   

&После("ПередЗаписью")
Процедура Руф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не Исполнитель = Задача.Исполнитель Тогда   
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Исполнитель в задаче и вводе факта отличаются!";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры
