
&НаСервере
Процедура ЗагрузитьМетодыМодуляНаСервере(СтруктураПараметров)
	
	АМ_РаботаСТекстомПроцедурИФункцийСервер.РазобратьМассивФайловНаСервере(СтруктураПараметров);
	
КонецПроцедуры


&НаСервере
Функция ПолучитьКаталогКонфигурации(КонфигурацияСсылка)
	Возврат	РегистрыСведений.АМ_КаталогиФайловМодулейКонфигураций.ПолучитьКаталогПоКонфигурации(КонфигурацияСсылка);
КонецФункции	


&НаКлиенте
Процедура ЗагрузитьМетодыМодуля(Команда)
	КаталогКонфы = ПолучитьКаталогКонфигурации(Команда.ИспользуемаяТаблица.ТекущиеДанные.Владелец);
	
	АМ_РаботаСТекстомПроцедурИФункцийКлиентСервер.ПрочитатьФайлыИПоместитьДляАнализа(ЭтаФорма.АдресВременногоХранилищаМассива, ЭтаФорма.УникальныйИдентификатор, КаталогКонфы, 2);
	
	СтруктураПараметров = АМ_РаботаСТекстомПроцедурИФункцийКлиентСервер.ПолучитьСтруктуруПараметровЗапускаЗакгрузки();
	
	СтруктураПараметров.Конфигурация =  Команда.ИспользуемаяТаблица.ТекущиеДанные.Владелец;
	СтруктураПараметров.НаименованиеМодуля = Команда.ИспользуемаяТаблица.ТекущиеДанные.Наименование;
	СтруктураПараметров.АдресСМассивомФайлов  = ЭтаФорма.АдресВременногоХранилищаМассива;
	СтруктураПараметров.ВидЗагрузки = 2;
		
	ЗагрузитьМетодыМодуляНаСервере(СтруктураПараметров);

КонецПроцедуры
