
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидимостьЗакладокКоммента();
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьЗакладокКоммента()
	Если Объект.Важно = "" и  НЕ Объект.КомментарийВручную Тогда
		Элементы.ГруппаВажно.Видимость = Ложь;
	Иначе                                     
		Элементы.ГруппаВажно.Видимость = Истина;
		
	КонецЕсли;	                
	
	Если Объект.Пример = "" и  НЕ Объект.КомментарийВручную Тогда
		Элементы.ГруппаПример.Видимость = Ложь;
	Иначе	
		Элементы.ГруппаПример.Видимость = Истина;
	КонецЕсли;	
	
	Если Объект.КомментарийВручную Тогда
		Элементы.СтраницаКоммВручную.Видимость = Истина;	
		СформироватьТекстКомментарияНаСервере();
	Иначе	
		Элементы.СтраницаКоммВручную.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура КомментарийВручнуюПриИзмененииНаСервере()
	ВидимостьЗакладокКоммента();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийВручнуюПриИзменении(Элемент)
	КомментарийВручнуюПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьТекстКомментарияНаСервере()                                   
	
		//АМ_РаботаСТекстомПроцедурИФункцийСервер.ЗаполнитьТекстКомментария(Объект.Ссылка, КомментарийВручнуюТекст);
	АМ_РаботаСТекстомПроцедурИФункцийСервер.ЗаполнитьТекстКомментария(Объект, КомментарийВручнуюТекст);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТекстКомментария(Команда)
	Если Не Объект.Ссылка.Пустая() Тогда
		СформироватьТекстКомментарияНаСервере();
	Иначе
		Сообщить("Прежде чем формирвать комментрий, необоходимо записать метод.");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПараметрыОтредактированы" Тогда
		КомандаПустая = Новый КомандаКомандногоИнтерфейса;
		СформироватьТекстКомментария(КомандаПустая);
	ИначеЕсли	ИмяСобытия = "ПроцедурыФункции_ДобавлениеСпискаВКомменты" Тогда
		Если	Параметр <> "" Тогда
			Объект.ТекстКомментария = Объект.ТекстКомментария + Символы.ПС + Параметр;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПоКомментариюНаСервере()
	АМ_РаботаСТекстомПроцедурИФункцийСервер.ПерезаполнитьПараметрыИзТекстаКомментария(Объект.ТекстКомментария, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыПоКомментарию(Команда)
	ЗаполнитьПараметрыПоКомментариюНаСервере();
	Оповестить("ПроцедурыИФункции_ПараметрыОбновлены");
КонецПроцедуры

&НаСервере
Процедура ДобавитьТекстСпискаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТекстСписка(Команда)                                                      
	ФормаСписка = ПолучитьФорму("Справочник.АМ_ПроцедурыИФункции.Форма.ФормаВставкаСписка");
	ОткрытьФорму(ФормаСписка);
	ДобавитьТекстСпискаНаСервере();
КонецПроцедуры
