
&НаСервере
Процедура ЗаполнитьПараметрыНаСервере()
	
	Если Объект.СтрокаПоискаРеквизитОбработки <> "" Тогда 
		МассивСтрокПоиска = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Объект.СтрокаПоискаРеквизитОбработки," ",Истина);
		Объект.СтрокаПоиска = "";
		Для Каждого ЭлменетСтр Из МассивСтрокПоиска Цикл 
			Объект.СтрокаПоиска = Объект.СтрокаПоиска + "%" + СокрЛП(ЭлменетСтр);
		КонецЦикла;	
		Объект.СтрокаПоиска = Объект.СтрокаПоиска + "%";
	КонецЕсли;
	
	СтрукутураПараметров = Новый Структура;
	Для Каждого ТекПараметр Из  СписокМетодов.Параметры.Элементы Цикл    
		СтрукутураПараметров.Вставить(Строка(ТекПараметр.Параметр), ТекПараметр.Значение);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(СтрукутураПараметров, Объект);
	Для Каждого ТекЭлементСтр Из СтрукутураПараметров Цикл
		ПараметрКомпТек = СписокМетодов.Параметры.ДоступныеПараметры.НайтиПараметр( Новый ПараметрКомпоновкиДанных(ТекЭлементСтр.Ключ));
		Если ПараметрКомпТек <> Неопределено Тогда 
			СписокМетодов.Параметры.УстановитьЗначениеПараметра(ПараметрКомпТек.Параметр, ТекЭлементСтр.Значение); 
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметры(Команда)
	ЗаполнитьПараметрыНаСервере();
	Элементы.СписокМетодов.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ЗаполнитьПараметрыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.СписокМетодов.Обновить();
КонецПроцедуры

&НаСервере
Процедура СписокМетодовВыборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокМетодовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	Если Поле.Имя =  "СписокМетодовМетод" Тогда         
		Если Элемент.ТекущиеДанные <> Неопределено и ЗначениеЗаполнено(Элемент.ТекущиеДанные.Метод) Тогда
			ПоказатьЗначение(,Элемент.ТекущиеДанные.Метод);
		КонецЕсли;	
	КонецЕсли;
	СписокМетодовВыборНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	//ЗаполнитьПараметрыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ЗаполнитьПараметрыНаСервере();
КонецПроцедуры
