


&НаСервере
Процедура ЗаписатьНаСервере()
	БЗ_ОбщийМодульСервер.УстановитьКонстанту("ПутьБЗ", ПутьКФайлам);
	БЗ_ОбщийМодульСервер.УстановитьКонстанту("pdftotext", ПутьКУтилите);
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПутьКФайлам = БЗ_ОбщийМодульСервер.ПолучитьКонстанту("ПутьБЗ", "");
	ПутьКУтилите = БЗ_ОбщийМодульСервер.ПолучитьКонстанту("pdftotext", "");
КонецПроцедуры
