
&НаСервере
Процедура ДобавитьКомментарийВМктодНаСервере()
	МассивРазделителей =  ПолучитьМассивРазделителей();
	ТекРазделитель = "";
	Для Каждого ТекРазд Из МассивРазделителей Цикл
		Если СтрНайти(СтрокаСписка, ТекРазд) <> 0 Тогда
			ТекРазделитель = ТекРазд;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	     
	Если ТекРазделитель <> "" Тогда 
		МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаСписка, ТекРазделитель, Истина, Истина);
		
		Для Каждого ТекСтрокаРазд Из МассивСтрок Цикл
			СтрокаКомментария = СтрокаКомментария + ?(СтрокаКомментария = "","", Символы.ПС) + 
								"//"+АМ_РаботаСТекстомПроцедурИФункцийСервер.ПолучитьСтрокуПробелов(КоличествоПробелов) +  
								ТекСтрокаРазд + " " + Символ(8211) + " " + "Значение не определено";
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарийВМктод(Команда)
	ДобавитьКомментарийВМктодНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивРазделителей()
	МассивРазделителей = Новый Массив;
	МассивРазделителей.Добавить(",");
	МассивРазделителей.Добавить(";");
	МассивРазделителей.Добавить("\");
	МассивРазделителей.Добавить("/");
	МассивРазделителей.Добавить("¶");
	МассивРазделителей.Добавить(Символы.ВТаб);
	МассивРазделителей.Добавить(Символы.ПС);
	МассивРазделителей.Добавить(Символы.ВК);
	МассивРазделителей.Добавить(Символы.Таб);
	Возврат МассивРазделителей;
КонецФункции	

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ПроцедурыФункции_ДобавлениеСпискаВКомменты", СтрокаКомментария);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоПробелов = 6;
КонецПроцедуры
