
#Область ПрограммныйИнтерфейс

Функция ТаблицаОсновныхТипов() Экспорт 
	ЗапросПоОсновнымТипам = Новый Запрос;
	ЗапросПоОсновнымТипам.Текст = "ВЫБРАТЬ
	                              |	АМ_ТипыЗначений.Наименование КАК Наименование,
	                              |	АМ_ТипыЗначений.Списочный КАК Списочный,
	                              |	АМ_ТипыЗначений.Ссылка КАК Ссылка
	                              |ИЗ
	                              |	Справочник.АМ_ТипыЗначений КАК АМ_ТипыЗначений
	                              |ГДЕ
	                              |	НЕ АМ_ТипыЗначений.ПометкаУдаления
	                              |	И АМ_ТипыЗначений.Типовой";
	ТаблицаТипов = ЗапросПоОсновнымТипам.Выполнить().Выгрузить();
	

	Возврат ТаблицаТипов;
	
КонецФункции
 
#КонецОбласти
 
