Функция ОбъектВСтруктуру(Объект, ДополнительныеРеквизиты = Неопределено) Экспорт
	#Если Сервер И НЕ Сервер Тогда
		Объект = Справочники.тт_ЭлементыРасписания.СоздатьЭлемент();
	#КонецЕсли
	ОМ = Объект.Метаданные();
	Результат = Новый Структура;
	Для Каждого Реквизит Из ОМ.СтандартныеРеквизиты Цикл
		Результат.Вставить(Реквизит.Имя);
	КонецЦикла;
	Для Каждого Реквизит Из ОМ.Реквизиты Цикл
		Если Реквизит.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
			Продолжить;
		КонецЕсли;
		Результат.Вставить(Реквизит.Имя);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Результат, Объект);
	
	Если ДополнительныеРеквизиты <> Неопределено Тогда
		Для Каждого ДопРеквизит Из ДополнительныеРеквизиты Цикл
			Результат.Вставить(ДопРеквизит.Ключ, ДопРеквизит.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция СтруктураВОбъект(Объект, Структура, СписокСвойств = Неопределено, Знач СписокИсключаемыхСвойств = Неопределено) Экспорт
	Если СписокИсключаемыхСвойств <> Неопределено Тогда
		СписокИсключаемыхСвойств = СписокИсключаемыхСвойств + ",Ссылка";
	ИначеЕсли СписокСвойств = Неопределено Тогда
		СписокИсключаемыхСвойств = "Ссылка";
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Объект, Структура,СписокСвойств,СписокИсключаемыхСвойств);
КонецФункции



