
&НаСервере
Функция ПолучитьКаталогПоКонфигурации(Конфигурация) Экспорт
	ЗапросПоКонфе = Новый Запрос;
	ЗапросПоКонфе.Текст ="ВЫБРАТЬ
	                     |	АМ_КаталогиФайловМодулейКонфигураций.КаталогПути КАК КаталогПути
	                     |ИЗ
	                     |	РегистрСведений.АМ_КаталогиФайловМодулейКонфигураций КАК АМ_КаталогиФайловМодулейКонфигураций
	                     |ГДЕ
	                     |	АМ_КаталогиФайловМодулейКонфигураций.Конфигурация = &Конфигурация";
	ЗапросПоКонфе.УстановитьПараметр("Конфигурация", Конфигурация);
	ВыборкаРег = ЗапросПоКонфе.Выполнить().Выбрать();
	Если ВыборкаРег.Следующий() Тогда
		КаталогКонфы = ВыборкаРег.КаталогПути;
	Иначе
		КаталогКонфы = "";
	КонецЕсли;
	Возврат   КаталогКонфы;
КонецФункции	

&НаСервере
Процедура ЗаписатьКаталогПоКонфигурации(Конфигурация, ТекстКаталог) Экспорт
	МенеджерЗаписиРег = РегистрыСведений.АМ_КаталогиФайловМодулейКонфигураций.СоздатьМенеджерЗаписи();
	МенеджерЗаписиРег.Конфигурация = Конфигурация;
	МенеджерЗаписиРег.КаталогПути  = ТекстКаталог;
	МенеджерЗаписиРег.Записать();
КонецПроцедуры	