
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.ВходящаяДата = Объект.Дата;
КонецПроцедуры


&НаКлиенте
Процедура ДанныеЗадачаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Данные.ТекущиеДанные;
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Руф_Наряд","");
	СтруктураРеквизитов.Вставить("Руф_ВЗР","");
	СтруктураРеквизитов.Вставить("Руф_Постановщик","");
	СтруктураРеквизитов.Вставить("Исполнитель","");   
	СтруктураРеквизитов.Вставить("Руф_ТипВремени","");
	ЗначенияРеквизитовОбъекта = ЗначенияРеквизитовОбъекта_НаСервере(СтруктураРеквизитов, ТекДанные.Задача); 
	
	ТекДанные.Наряд = ЗначенияРеквизитовОбъекта.Руф_Наряд; 
	ТекДанные.ВЗР = ЗначенияРеквизитовОбъекта.Руф_ВЗР;
	ТекДанные.Постановщик = ЗначенияРеквизитовОбъекта.Руф_Постановщик;
	ТекДанные.Исполнитель = ЗначенияРеквизитовОбъекта.Исполнитель;
	ТекДанные.ТипВремени = ЗначенияРеквизитовОбъекта.Руф_ТипВремени;
	
КонецПроцедуры

&НаСервере
Функция ЗначенияРеквизитовОбъекта_НаСервере(Знач СтруктураРеквизитов, Знач Задача)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задача,СтруктураРеквизитов);

КонецФункции

&НаКлиенте
Процедура ДанныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ТекДанные = Элементы.Данные.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		
		ТекДанные.ПроцентРаспределения = 70;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСуммаРеализацииПриИзменении(Элемент)
	ТекДанные = Элементы.Данные.ТекущиеДанные;
	
	ТекДанные.СуммаРаспределения = ТекДанные.СуммаРеализации*ТекДанные.ПроцентРаспределения/100;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПроцентРаспределенияПриИзменении(Элемент)
	ТекДанные = Элементы.Данные.ТекущиеДанные;
	
	ТекДанные.СуммаРаспределения = ТекДанные.СуммаРеализации*ТекДанные.ПроцентРаспределения/100;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.ВходящаяДата=ТекущаяДата();
		
	КонецЕсли;	
КонецПроцедуры
