Функция ОкруглитьДату(Дата, Период, Режим = Неопределено) Экспорт
	Если Режим = Неопределено Тогда
		Режим = РежимОкругления.Окр15как20;
	КонецЕсли;
	НачДня = НачалоДня(Дата);
	Остаток = Окр((Дата - НачДня)/Период,0, Режим);
	Возврат НачДня + Остаток * Период;
КонецФункции

Функция УдалитьДублиИзМассива(ИсходныйМассив) Экспорт
	Массив = Новый Массив;
	Для Каждого Элемент Из ИсходныйМассив Цикл
		Если Массив.Найти(Элемент) = Неопределено Тогда
			Массив.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
КонецФункции