
Процедура ОбработкаСообщенияСистемыВзаимодействия(Сообщение, ДополнительныеПараметры)
	
	ОтветноеСообщение = СистемаВзаимодействия.СоздатьСообщение(Сообщение.Обсуждеие);
	
	ТекстСообщения = Сообщение.Сообщение;                 
	
	ОтветноеСообщение.Текст = "Зеркально: "+ТекстСообщения;
	
	ОтветноеСообщение.Записать();
	
	
КонецПроцедуры

Процедура ОбработкаНажатияКнопкиПанелиКнопокСообщенияСистемыВзаимодействия(Сообщение, Кнопка, Пользователь, ДополнительныеПараметры)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриСозданииОбсужденияСистемыВзаимодействия(ИдентификаторОбсуждения, ДополнительныеПараметры)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриДобавленииВОбсуждениеСистемыВзаимодействия(ИдентификаторОбсуждения, ДополнительныеПараметры)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриУдаленииИзОбсужденияСистемыВзаимодействия(ИдентификаторОбсуждения, ДополнительныеПараметры)
	// Вставить содержимое обработчика.
КонецПроцедуры
