
&НаСервере
Процедура УстановитьПризнакНаВсеМетодвМодуляНаСервере()
	
	ЗапросПоМетодам = Новый Запрос;
	ЗапросПоМетодам.Текст = "ВЫБРАТЬ
	                        |	АМ_ПроцедурыИФункции.Ссылка КАК Ссылка
	                        |ИЗ
	                        |	Справочник.АМ_ПроцедурыИФункции КАК АМ_ПроцедурыИФункции
	                        |ГДЕ
	                        |	АМ_ПроцедурыИФункции.Владелец = &МодульСсылка";
	ЗапросПоМетодам.УстановитьПараметр("МодульСсылка", Объект.Ссылка);
	ВыборкаМетодов = ЗапросПоМетодам.Выполнить().Выбрать();
	Пока ВыборкаМетодов.Следующий() Цикл
		ТекМетодСсылка = ВыборкаМетодов.Ссылка;
		ТекМетодОбъект = ТекМетодСсылка.ПолучитьОбъект();
		ТекМетодОбъект.НеТиповая = Объект.НеТиповой;
		Попытка
			ТекМетодОбъект.Записать();
		Исключение
		КонецПопытки;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПризнакНаВсеМетодвМодуля(Команда)
	УстановитьПризнакНаВсеМетодвМодуляНаСервере();
КонецПроцедуры

