
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Руф_КонтрольРеализаций Расход
	Движения.Руф_КонтрольРеализаций.Записывать = Истина;
	Для Каждого ТекСтрокаДанные Из Данные Цикл
		Движение = Движения.Руф_КонтрольРеализаций.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Задача = ТекСтрокаДанные.Задача;
		Движение.Исполнитель = ТекСтрокаДанные.Исполнитель;
		Движение.ТипВремени = ТекСтрокаДанные.ТипВремени;
		Движение.Контрагент = Контрагент;
		Движение.ВЗР = ТекСтрокаДанные.ВЗР;
		Движение.Часы = ТекСтрокаДанные.Часы;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
