
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.АвторизованныйПользователь();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.узЗадачи") Тогда
		Задача = ДанныеЗаполнения;
		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,"Наименование, ТекстСодержания, Исполнитель");
		Наименование = СтруктураРеквизитов.Наименование;
		Примечание = Лев(СтрЗаменить(СтруктураРеквизитов.ТекстСодержания,Символы.ПС," "),500);
		Исполнитель = СтруктураРеквизитов.Исполнитель;
	КонецЕсли;
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	ВремяПлановое = (ДатаОкончанияПлан - ДатаНачалаПлан)/3600;
	Минимум = Дата(1,1,1);
	Максимум = Дата(1,1,1);
	Для Каждого СтрокаТЧ Из Факт Цикл
		Если Минимум = Дата(1,1,1) Тогда
			Минимум = СтрокаТЧ.ДатаНачалаФакт;
		Иначе
			Минимум = Мин(Минимум,СтрокаТЧ.ДатаНачалаФакт);
		КонецЕсли;
		Если СтрокаТЧ.ДатаОкончанияФакт <> Дата(1,1,1) Тогда
			Максимум = Макс(Максимум, СтрокаТЧ.ДатаОкончанияФакт);
			СтрокаТЧ.Факт = СтрокаТЧ.ДатаОкончанияФакт - СтрокаТЧ.ДатаНачалаФакт;
		КонецЕсли;
	КонецЦикла;
	ВремяФактическое = Факт.Итог("Факт")/3600;
	Если Максимум <> Дата(1,1,1) Тогда
		ВремяАстрономическое = (Максимум - Минимум)/3600;
	Иначе
		ВремяАстрономическое = 0;
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	СообшениеОбОшибке = "";
	Для Каждого СтрокаТЧ Из Факт Цикл
		Если СтрокаТЧ.ДатаОкончанияФакт <> Дата(1,1,1) И СтрокаТЧ.ДатаОкончанияФакт < СтрокаТЧ.ДатаНачалаФакт Тогда
			Отказ = Истина;
			СообшениеОбОшибке = СообшениеОбОшибке + Символы.ПС + "Не корректно заполнено время в строке " + СтрокаТЧ.НомерСтроки;
		КонецЕсли;
	КонецЦикла;
	Если Отказ Тогда
		ВызватьИсключение СообшениеОбОшибке;
	КонецЕсли;
КонецПроцедуры

