

&НаКлиенте
Процедура ПеречитатьСодержимое(Команда)
	Стр = Элементы.Список.ТекущиеДанные;
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ПеречитатьДанныеФайлов(Стр.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПеречитатьДанныеФайлов(ВыбСсылка)
	Путь = 	Справочники.УзКонстанты.НайтиПоНаименованию("ПутьБЗ").Значение;
	Элем = ВыбСсылка.ПолучитьОбъект();
	
	Для каждого Стр Из Элем.Файлы Цикл
		Стр.СодержимоеФайла = БЗ_ОбщийМодульСервер.ИзвлечьТекстНаСервере(Путь + Стр.Файл);		
	КонецЦикла;
	
	Элем.Записать();
	
КонецПроцедуры
