Перем ирПлатформа Экспорт;
Перем ирПерехватКлавиатуры Экспорт;

&After("OnStart")
&После("ПриНачалеРаботыСистемы")
Процедура ирПриНачалеРаботыСистемы()
	
	Если ирСервер.ПриНачалеРаботыСистемыРасширениеЛкс(ПараметрЗапуска) Тогда 
		ирКлиент.ПерезапуститьСеансПослеДобавленияРолиЛкс();
	Иначе
	#Если Не ТонкийКлиент И Не ВебКлиент И Не МобильныйКлиент Тогда
		ОткрытьОднократноАдаптациюРасширенияЛкс(ирПерехватКлавиатуры);
	#КонецЕсли 
	КонецЕсли; 
	Если Истина
		И ПравоДоступа("Использование", Метаданные.Обработки.ирПортативный) 
		И Найти(ПараметрЗапуска, "ОткрытьСтартерИР") = 0
	Тогда
		Обработки.ирПортативный.ПолучитьФорму().Открыть();
	КонецЕсли; 
	
КонецПроцедуры

&After("ExternEventProcessing")
&После("ОбработкаВнешнегоСобытия")
Процедура ирОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	Если Источник = "KeyboardHook" Тогда
		ВнешнееСобытиеЛкс(Источник, Событие, Данные);
	КонецЕсли; 
	
КонецПроцедуры
