Перем ирПлатформа Экспорт;
Перем ирПерехватКлавиатуры Экспорт;

&After("OnStart")
&После("ПриНачалеРаботыСистемы")
Процедура ирПриНачалеРаботыСистемы()
	
	Если ирСервер.ПриНачалеРаботыСистемыРасширениеЛкс(ПараметрЗапуска) Тогда 
		ирКлиент.ПерезапуститьСеансПослеДобавленияРолиЛкс();
	Иначе
	#Если Не ВебКлиент И Не МобильныйКлиент Тогда
		ОткрытьОднократноАдаптациюРасширенияЛкс(ирПерехватКлавиатуры);
	#КонецЕсли 
	КонецЕсли; 

КонецПроцедуры

&After("ExternEventProcessing")
&После("ОбработкаВнешнегоСобытия")
Процедура ирОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	Если Источник = "KeyboardHook" Тогда
		ВнешнееСобытиеЛкс(Источник, Событие, Данные);
	КонецЕсли; 
	
КонецПроцедуры
